In [1]:
#continued from part 1

In [2]:
import numpy as np
import pandas as pd

In [3]:
from numpy.random import randn

In [15]:
np.random.seed(101)

In [16]:
df = pd.DataFrame(randn(5,4),["A","B","C","D","E"], ["W","X","Y","Z"])

In [17]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [18]:
booldf = df>0

In [19]:
booldf

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [20]:
df[booldf] # we will get the values > 0 ,

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [21]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [22]:
df["W"] > 0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [25]:
df[df["W"] >0] #here the cth row is less than 0 and does not satisfy the given condition 
#so the whole of cth row will be removed 
#when we gave df["w"] > 0 , the c'th row will be false.That is why it will be removed

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [29]:
df[df["Z"] < 0] # will retur only cth row because it is < 0 only in that case

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [31]:
df["W"]>0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool